public class May19 {
    public static void main(String[] args) {
        
        /*
        자동, 명시적, 인스턴스 블럭 루틴, 생성자 순서로 초기화

        인스턴스 블럭: 인스턴스가 생성될 때마다 실행되는 블럭
        --> 모든 생성자가 가져야 하는 공통적인 코드를 인스턴스 블럭에 넣으면 코드 중복을 줄일 수 있다. 

        인스턴스 블럭 초기화 루틴은 인스턴스 뿐만 아니라 static 변수도 초기화할 수 있다.
        하지만 static 변수는 static 블럭에서 초기화하는 것이 좋다.
        static 블럭은 static한 요소만 초기화 가능

        static 블럭 초기화 루틴은 클래스가 로딩될 때 실행된다.
        하지만 여러번 실행되지 않는다. (클래스가 로딩될 때 한번만 실행)

        인스턴스 블럭은 인스턴스가 생성될 때마다 실행된다.
        */
    }
}
